{
    "welcome-iam": "Welcome, I'm {{name}}",
    "about": "About",
    "about-me": "About me",
    "home": "Home",
    "projects": "Projects",
    "contact-me": "Contact me",
    "change-language": "Change language",
    "lighting": "Lighting",
    "work-experience": "Work Experience",
    "education": "Education",
    "about-me-short-desciption": "Software Engineer driven by a passion for turning<1/><1/> complex ideas into practical, impactful digital experiences.",
    "about-me-description": "I’m a Software Engineer with a multidisciplinary background spanning mobile development, ERP systems, and public sector digital transformation.<1/><1/>My academic focus on computer vision introduced me to the fundamentals of AI and data science, shaping my interest in practical, user-driven solutions.<1/><1/>I started my career as a freelance Android developer, then worked as a Full Stack Developer building ERP solutions. Currently, I’m part of the High Commission for Digitalization in Algeria, where I develop secure, scalable systems that modernize public services and support e-governance.<1/><1/>I’m passionate about applying emerging technologies to build meaningful, efficient software—always learning and adaptable to new tools and programming environments.",
    "hcn-high-commission-for-digitalization":"HCN - High commission for digitalization",
    "software-engineer": "Software engineer",
    "hcn-description": "Software Engineer at the High Commission for Digitalization in Algeria, focusing on developing software systems that support public sector digital transformation. I work on projects involving e-governance, creating scalable solutions that optimize government processes, and integrating new technologies to improve public services. My role includes software development, system integration, and ensuring the security and efficiency of digital platforms for national use.",
    "hcn-timeline": "Sept 2024 - Present",
    "hcn-headquarter": "Hydra, Algiers",
    "kb-systems": "KB Systems",
    ".net-full-stack-developer" : ".Net full stack developer",
    "kb-systems-description": "During my time at KB Systems, I worked as a full-stack software developer, specializing in ERP software development. I was responsible for designing, developing, and maintaining robust ERP solutions, contributing to both front-end and back-end components. My role involved close collaboration with cross-functional teams to enhance system performance and deliver features tailored to business needs.",
    "kb-systems-timeline": "Oct 2023 - Sept 2024",
    "kb-systems-headquarter": "Mohammadia, Algiers",
    "android-mobile-developer": "Android mobile developer",
    "fiverr": "Fiverr",
    "fiverr-description": "During my studies, I worked remotely as a freelance Android mobile developer. Through platforms like Fiverr, I collaborated with international clients on a variety of projects, building custom mobile applications tailored to their needs. This experience strengthened my technical skills, taught me how to manage client expectations, and helped me deliver reliable, user-centric solutions independently.",
    "fiverr-timeline": "Jan 2023 - dec 2023",
    "fiverr-headquarter": "Remote",
    "ml-engineer-intern": "Machine learning intern",
    "craag": "Craag",
    "craag-description": "As an intern in the field of computer science at CRAAG, we worked on developing an automated and intelligent task utilizing machine learning techniques. This task proved invaluable in aiding astronomers with the detection and classification of solar spots based on their magnetic properties. Our contribution played a pivotal role in advancing solar astronomy research and enhancing the effectiveness of data analysis.",
    "craag-timeline": "Feb 2023 - July 2023",
    "craag-headquarter": "Bouzareah, Algiers",
    "show-all": "Show all",
    "hide-all": "Hide all",
    "usthb": "USTHB",
    "ecoin": "Ecoin",
    "master-computer-vision": "Master's degree, Computer vision",
    "isil-timeline":"Sept 2018 - Juil 2021",
    "miv-timeline":"Sept 2021 - Juil 2023",
    "ecoin-timeline": "Nov 2022 - April 2024",
    "graphic-design": "Graphic design",
    "usthb-headquarter": "Bab ezzouar, Algiers",
    "ecoin-headquarter": "Algiers",
    "bachelor-computer-science": "Bachelor's in computer science",
    "checkout-my-work": "Checkout some of my work",
    "projects-description": "I've worked on a variety of projects, including desktop, mobile, and web applications. Unfortunately, some of them are private and cannot be shared. However, here are a few selected projects that I can showcase."
}