{
  "welcome-iam": "Bienvenue, je suis {{name}}",
  "about": "À propos",
  "about-me": "À propos de moi",
  "home": "Accueil",
  "projects": "Projets",
  "contact-me": "Contactez-moi",
  "change-language": "Changer la langue",
  "lighting": "Thème",
  "work-experience": "Expérience professionnelle",
  "about-me-short-desciption": "Ingénieure logicielle passionnée par la transformation<1/><1/> d'idées complexes en expériences numériques concrètes et percutantes.",
  "about-me-description": "Je suis une ingénieure logicielle avec un parcours pluridisciplinaire incluant le développement mobile, les systèmes ERP et la transformation numérique du secteur public.<1/><1/>Mon parcours académique en vision par ordinateur m’a initiée aux bases de l’intelligence artificielle et de la science des données, nourrissant mon intérêt pour des solutions concrètes et centrées sur l’utilisateur.<1/><1/>J’ai débuté ma carrière en tant que développeuse Android freelance, puis j’ai travaillé comme développeuse full-stack sur des solutions ERP. Actuellement, je fais partie du Haut Commissariat à la Numérisation en Algérie, où je développe des systèmes sécurisés et évolutifs pour moderniser les services publics et soutenir la gouvernance électronique.<1/><1/>Je suis passionnée par l'application des technologies émergentes pour créer des logiciels utiles et efficaces, tout en restant curieuse et adaptable à de nouveaux outils et environnements de développement.",
  "hcn-high-commission-for-digitalization": "HCN - Haut Commissariat à la Numérisation",
  "software-engineer": "Ingénieure logicielle",
  "hcn-description": "Ingénieure logicielle au Haut Commissariat à la Numérisation en Algérie, je travaille au développement de systèmes logiciels soutenant la transformation numérique du secteur public. Je participe à des projets de gouvernance électronique, à la création de solutions évolutives optimisant les processus administratifs, ainsi qu’à l’intégration de nouvelles technologies pour améliorer les services publics. Mon rôle inclut le développement logiciel, l’intégration de systèmes et la garantie de la sécurité et de l’efficacité des plateformes numériques à l’échelle nationale.",
  "hcn-timeline": "Septembre 2024 - Présent",
  "hcn-headquarter": "Hydra, Alger",
  "kb-systems": "KB Systems",
  ".net-full-stack-developer": "Développeuse .Net full stack",
  "kb-systems-description": "Pendant mon expérience chez KB Systems, j’ai travaillé en tant que développeuse full-stack spécialisée dans le développement de logiciels ERP. J’étais chargée de concevoir, développer et maintenir des solutions ERP robustes, en contribuant à la fois aux composants front-end et back-end. Mon rôle impliquait une collaboration étroite avec des équipes pluridisciplinaires afin d'améliorer les performances du système et de livrer des fonctionnalités adaptées aux besoins métiers.",
  "kb-systems-timeline": "Octobre 2023 - Septembre 2024",
  "kb-systems-headquarter": "Mohammadia, Alger",
  "android-mobile-developer": "Développeuse mobile Android",
  "fiverr": "Fiverr",
  "fiverr-description": "Pendant mes études, j'ai travaillé à distance en tant que développeuse mobile Android freelance. Grâce à des plateformes comme Fiverr, j'ai collaboré avec des clients internationaux sur une variété de projets, en développant des applications mobiles personnalisées adaptées à leurs besoins. Cette expérience a renforcé mes compétences techniques, m'a appris à gérer les attentes des clients et m'a permis de livrer des solutions fiables et centrées sur l'utilisateur, de manière autonome.",
  "fiverr-timeline": "Jan 2023 - Déc 2023",
  "fiverr-headquarter": "À distance",
  "ml-engineer-intern": "Stagiaire en apprentissage automatique",
  "craag": "Craag",
  "craag-description": "En tant que stagiaire en informatique au CRAAG, nous avons travaillé sur le développement d’une tâche automatisée et intelligente en utilisant des techniques d’apprentissage automatique. Cette tâche s’est révélée précieuse pour aider les astronomes à détecter et classifier les taches solaires en fonction de leurs propriétés magnétiques. Notre contribution a joué un rôle clé dans l’avancement de la recherche en astronomie solaire et dans l’amélioration de l’analyse des données.",
  "craag-timeline": "Fév 2023 - Juil 2023",
  "craag-headquarter": "Bouzareah, Alger",
  "show-all": "Afficher tout",
"hide-all": "Masquer tout"

}
